Repository: marinkyo/m17n
Catalog: namazu/po/*.po
Languages: eo

source: Fatal error occurred!
eo: Fatala eraro okazis!

source: Too long query
eo: Tro longa informpeto

source: Invalid query
eo: Senvalida informpeto

source: Too many query tokens
eo: Tro multaj informpetaj ĵetono

source: Too many words matched. Ignored
eo: Tro multaj vortoj kogruis. Ignorita

source: Too many documents hit. Ignored
eo: Tro multaj dokumentoj kogruis. Ignorita

source: can't open the regex index
eo: ne eblas malfermi la indekson de regula esprimo

source: can't open the phrase index
eo: ne eblas malfermi la indekson de frazo

source: can't open the field index
eo: ne eblas malfermi la indekson de kampo

source: can't open the index
eo: ne eblas malfermi indekson

source: can't open the result format file
eo: ne eblas malfermi la rezultan dosierformon

source: You don't have a permission to access the index
eo: Vi ne havas permeson por atingi la indekson

source: The index is locked for maintenance
eo: La indekson estas ŝlosita por vartolabro

source: Present index is old type. it's unsupported.
eo: Prezenta indekso estas malnova tipo. estas neeltenebla.

source: Unknown error. Report bug!
eo: Nekonata eraro. Raportu cimon!

source: Invalid idxname.
eo: Nevalida indeksnomo.

source: Too long QUERY_STRING
eo: Tro longa QUERY_STRING

source: <strong>Page:</strong>
eo: <strong>Paĝo:</strong>

source: Current List: %d
eo: Listo actuala: %d

source: [ TOTAL: %d ]
eo: [ TOTALO: %d ]

source: <p><strong> Total
eo: <p><strong> Totalo

source: documents matching your query.</strong></p>
eo: dokumentoj estis kongruitaj al via informpeto.</strong></p>

source: <h2>Error!</h2> <p>%s</p>
eo: <h2>Eraro!</h2> <p>%s</p>

source: <h2>Results:</h2>
eo: <h2>Rezultoj:</h2>

source: References:
eo: Referencoj:

source: <p>No document matching your query.</p>
eo: <p>Neniaj dokumentoj estis kongruitaj al via informpeto.</p>

source: <h2>Error</h2> <p>
eo: <h2>Eraro</h2> <p>

source: can't find string terminator
eo: ne eblas trovi ĉeninilon

source: invalid directive name
eo: senvalida direktiva nomo

source: can't find arguments
eo: Ne eblas trovi argumentojn

source: too few arguments
eo: troa malmultaj argumentoj

source: too many arguments
eo: troa multaj argumentoj

source: unknown directive
eo: nekonata direktivo

source: %s:%d: syntax error: %s
eo: %s:%d: sintaksa eraro: %s

source: Loaded rcfile: %s
eo: Ŝargita rc-dosiero: %s

source: Index: %s Logging: %s Lang: %s Scoring: %s Template: %s MaxHit: %d MaxMatch: %d EmphasisTags: %s %s
eo: Indekso: %s Protolado: %s Lingvo: %s Poentaro: %s Ŝablono: %s MaksTrafo: %d MaksKongruo: %d EmfazMarkoj: %s %s

source: Replace: %-20s %s
eo: AnstataÅ­igo: %-20s %s

source: namazu %s, a search program of Namazu. Usage: namazu [options] <query> [index]... -n, --max=NUM set the number of documents shown to NUM. -w, --whence=NUM set the first number of documents shown to NUM. -l, --list print the results by listing the format. -s, --short print the results in a short format. --result=EXT set NMZ.result.EXT for printing the results. --late sort the documents in late order. --early sort the documents in early order. --sort=METHOD set a sort METHOD (score, date, field:name) --ascending sort in ascending order (default: descending) -a, --all print all results. -c, --count print only the number of hits. -h, --html print in HTML format. -r, --no-references do not display the reference hit counts. -H, --page print the links of further results. (This is nearly meaningless) -F, --form force to print the <form> ... </form> region. -R, --no-replace do not replace the URI string. -U, --no-decode-uri do not decode the URI when printing in a plain format. -o, --output=FILE set the output file name to FILE. -f, --config=FILE set the config file name to FILE. -C, --show-config print the current configuration. -q, --quiet do not display extra messages except search results. -d, --debug be in debug mode. -v, --version show the namazu version and exit. --help show this help and exit. --norc do not read the personal initialization files. -- Terminate option list. Report bugs to <%s> or <%s>.
eo: namazu %s, serĉa programo de Namazu. Uzado: namazu [opcioj] <demando> [indekso]... -n, --max=NUM agordas la numeron de dokumentoj montritaj al NUM. -w, --whence=NUM agordas la unuan numeron de dokumentoj montritaj al NUM. -l, --list printas la rezulton en lista formato. -s, --short printas la rezultojn en mallonga formato. --results=EXT agordas NMZ.result.EXT-n por printi la rezultoj. --late ordigas la dokumentoj por malfrua ordo. --early ordigas la dokuemtnoj por frua ordo. --sort=METODO agordas ordan METODO-n (score, date, field:name). --ascending ordigas supren (implicitaÄµo: malsupren). -a, --all printas la tutajn rezultojn. -c, --count printas nur la numero de dokumentoj. -h, --html printas en formato HTML. -r, --no-references ne vidigas numeron de dokumentoj koincidintaj. -H, --page printas krome rezultaj ligoj (morgaÅ­ senseca) -F, --form igas printi la regionon <form> ... </form>. -R, --no-replace ne anstataŭigas la ĉanon URI. -U, --no-decode-uri ne malkodas la ĉanon URI. -o, --output=FILE metas la dosiernomon al FILE. -f, --config=FILE metas la agordnomon al FILE. . -C, --show-config printas la actualan agordon -q, --quiet ne vidigas ekstrajn mesaĝojn escepte de la serĉajrezultoj. -d, --debug modo sencimiga. -v, --version montras la version de namazu kaj eliras. --help montras ĉi tiun helpon kaj eliras. --norc ne legas la personalajn provalorizajn dosierojn. -- Finigi opcian liston. Raportu la cimojn al <%s> aŭ­ <%s>.

source: Usage: namazu [options] <query> [index]...
eo: Uzado: namazu [opcioj] <demando> [indekso]...

source: Try `namazu --help' for more information.
eo: provu `namazu --help por pli multa informo.

source: files are found to be indexed.
eo: dosieroj estas trovitaj indeksitaj.

source: target file:
eo: celdosiero:

source: Writing index files...
eo: Skribas la indeksajn dosierojn...

source: Reading rcfile:
eo: legas rc-dosieron:

source: Checkpoint reached: re-exec mknmz...
eo: Kontrolpunkto alvenis: re-plenumas mknmz...

source: after load_document:
eo: post ŝalĝ_dokumentoj:

source: Detected type:
eo: Detekta tipo:

source: Unsupported media type
eo: Neeltenebla mediatipo

source: Using
eo: Uzas

source: unable to require
eo: Ne eblis postuli

source: Failed to call
eo: Fiaskis voki

source: No files to index.
eo: Ne dosieroj indeksita.

source: code conversion: using NKF module
eo: konverto de kodo: uzas NKF-modulon

source: wakati: using Text::Kakasi module
eo: Ŭakati: uzas Text::Kakasi modulonÄ

source: wakati: using Text::ChaSen module
eo: Ŭakati: uzas Text::ChaSen modulon

source: wakati: using MeCab module
eo: Uakati: uzas MeCab modulon

source: found. Maybe this index is being updated by another process now. If not, you can remove this file.
eo: trovita. Kredeble ĉi tiu indekso estas Ĝisdatigita de alia procedo nun. Si ne, vi povas elimini ĉi tiu dosieron.

source: Present index is old type. it's unsupported.
eo: Actuala indekso estas malnova tipo. Estas neeltenebla.

source: No such index:
eo: Ne tia indekso:

source: Inherited argv:
eo: Heredita argv:

source: Inherited cwd:
eo: Heredita cwd:

source: Loaded:
eo: Ŝargis:

source: Invalid replace:
eo: Nevalida anstataŭigo:

source: Replace:
eo: Anstataŭigas:

source: invalid output directory
eo: nevalida elmetita dosierujo

source: Loaded rcfile:
eo: Ŝargis rc-dosiero :

source: System:
eo: Sistemo:

source: Wakati:
eo: Ŭakati:

source: Lang:
eo: Lingvo:

source: Coding System:
eo: Sistemo de Kodado:

source: CONFDIR:
eo: Dosierujo de agordo:

source: Supported media types:
eo: Elteneblaj mediatipoj:

source: find_target starting:
eo: find_target komencas:

source: unsupported target:
eo: neeltenebla destino:

source: Unreadable: %s
eo: Nelegible: %s

source: Excluded: %s
eo: Ekskludis: %s

source: Too old: %s
eo: Troa malnova: %s

source: Too new: %s
eo: Tro nova: %s

source: Denied: %s
eo: neis: %s

source: Not allowed: %s
eo: Ne permisita: %s

source: Targeted: %s
eo: Destino: %s

source: find_target finished:
eo: find_target terminado:

source: Target Files: %d (Scan Performance: Elapsed Sec.: %d, Files/sec: %.1f)
eo: Ficheros Destino: %d (Rendimiento de escaneo: Consumo Seg: %d, Ficheros/seg: %.1f)

source: Possible: %d, Not allowed: %d, Denied: %d, Excluded: %d
eo: Posibles: %d, No permitidos: %d, Denegados: %d, ExcluÃÂ­dos: %d

source: MTIME too old: %d, MTIME too new: %d
eo: MTIME demasiado antiguo: %d, MTIME demasiado nuevo: %d

source: lang:
eo: lenguaje:

source: Usage: mknmz [options] <target>...
eo: Uso: mknmz [opciones] <destino>...

source: Try `mknmz --help' for more information.
eo: Intenta `mknmz --help para mÃÂ¡s informaciÃÂ³n.

source: skipped.
eo: ignorados.

source: system error occurred!
eo: ocurriÃÂ³ un error de sistema!

source: does NOT EXIST! skipped.
eo: NO EXISTE! ignorado.

source: is NOT READABLE! skipped.
eo: no es LEIBLE! ignorado.

source: is 0 size! skipped.
eo: tiene tamaÃÂ±o 0! ignorado.

source: may be a BINARY file! skipped.
eo: puede no ser un fichero BINARIO! ignorado.

source: is larger than your setup after filtered, skipped:
eo: es un texto demasiado LARGO! ignorado.

source: == found files ==
eo: == encontrados ==

source: == registered documents ==
eo: == documentos registrados ==

source: == updated documents ==
eo: == documentos actualizados ==

source: == files to index ==
eo: == ficheros a indexar ==

source: ## deleted:
eo: ## borrados:

source: ## indexed:
eo: ## indexados:

source: was deleted!
eo: fueron borrados!

source: was updated!
eo: fueron actulizados!

source: [Append]
eo: [AÃÂ±adido]

source: Date:
eo: Fecha:

source: Added Documents:
eo: Documentos AÃÂ±adidos:

source: Deleted Documents:
eo: Documentos Borrados:

source: Updated Documents:
eo: Documentos Actualizados:

source: Size (bytes):
eo: TamaÃÂ±o (bytes):

source: Total Documents:
eo: Total de Documentos:

source: Added Keywords:
eo: Palabras clave AÃÂ±adidas:

source: Total Keywords:
eo: Total de Palabras clave:

source: Time (sec):
eo: Tiempo (seg):

source: File/Sec:
eo: Ficheros/Seg:

source: System:
eo: Sistema:

source: doing write_phrase_hash() processing.
eo: haciendo el proceso de write_phrase_hash().

source: doing write_index() processing.
eo: Haciendo el proceso de write_index().

source: Renamed:
eo: Renombrados:

source: not an IO::File/FileHandle object!
eo: no es un objeto IO::File/FileHandle!

source: Remove temporary files:
eo: Borra los ficheros temporales:

source: ASSERTION ERROR!:
eo: ERROR DE ASERCIÃÂÃÂN!:

source: -- wakatized content --
eo: -- contenidos wakatizados --

source: invalid wakati module:
eo: mÃÂ³dulo wakati no vÃÂ¡lido:

source: -- wakatized bare content --
eo: -- contenido bare wakatizado --

source: wakati: using
eo: wakati: usando

source: mknmz %s, an indexer of Namazu. Usage: mknmz [options] <target>... Target files: -a, --all target all files. -t, --media-type=MTYPE set the media type for all target files to MTYPE. -h, --mailnews same as --media-type='message/rfc822' --mhonarc same as --media-type='text/html; x-type=mhonarc' -F, --target-list=FILE load FILE which contains a list of target files. --allow=PATTERN set PATTERN for file names which should be allowed. --deny=PATTERN set PATTERN for file names which should be denied. --exclude=PATTERN set PATTERN for pathnames which should be excluded. -e, --robots exclude HTML files containing <meta name="ROBOTS" content="NOINDEX"> -M, --meta handle HTML meta tags for field-specified search. -r, --replace=CODE set CODE for replacing URI. --html-split split an HTML file with <a name="..."> anchors. --mtime=NUM limit by mtime just like find(1)'s -mtime option. e.g., -50 for recent 50 days, +50 for older than 50. Morphological Analysis: -b, --use-mecab use MeCab for analyzing Japanese. -c, --use-chasen use ChaSen for analyzing Japanese. -k, --use-kakasi use KAKASI for analyzing Japanese. -m, --use-chasen-noun use ChaSen for extracting only nouns. -L, --indexing-lang=LANG index with language specific processing. Text Operations: -E, --no-edge-symbol remove symbols on edge of word. -G, --no-okurigana remove Okurigana in word. -H, --no-hiragana ignore words consist of Hiragana only. -K, --no-symbol remove symbols. --decode-base64 decode base64 bodies within multipart entities. Summarization: -U, --no-encode-uri do not encode URI. -x, --no-heading-summary do not make summary with HTML's headings. Index Construction: --update=INDEX set INDEX for updating. -z, --check-filesize detect file size changed. -Y, --no-delete do not detect removed documents. -Z, --no-update do not detect update and deleted documents. Miscellaneous: -s, --checkpoint turn on the checkpoint mechanism. -C, --show-config show the current configuration. -f, --config=FILE use FILE as a config file. -I, --include=FILE include your customization FILE. -O, --output-dir=DIR set DIR to output the index. -T, --template-dir=DIR set DIR having NMZ.{head,foot,body}.*. -q, --quiet suppress status messages during execution. -v, --version show the version of namazu and exit. -V, --verbose be verbose. -d, --debug be debug mode. --help show this help and exit. --norc do not read the personal initialization files. -- Terminate option list. Report bugs to <%s> or <%s>.
eo: mknmz %s, el indizador de Namazu. Usage: mknmz [opciones] <destino>... Ficheros destino: -a, --all todos ficheros destino. -t, --media-type=MTYPE pone el tipo de formato para todos los ficheros destino a MTYPE. -h, --mailnews lo mismo que --media-type='message/rfc822' --mhonarc lo mismo que --media-type='text/html; x-type=mhonarc' -F, --target-list=FILE carga FILE el cuÃÂ¡l contiene una lista de los ficheros destino. --allow=PATTERN pone la PATTERN para los nombres de ficheros para los cuales debe estar permitida. --deny=PATTERN pone la PATTERN para los nombres de los ficheros para los cuales debe estar denegada. --exclude=PATTERN pone la PATTERN para los nombres de directorios para los cuales deben estar excluÃÂ­dos. -e, --robots exlude los ficheros HTML que contienen <meta name="ROBOTS" content="NOINDEX"> -M, --meta maneja HTML meta tags para los campos especificados para buscar. -r, --replace=CODE pone CODE para reemplazar el URI. --html-split divide un fichero HTML con <a name="..."> anchors. --mtime=NUM limita por mtime como con find(1)'s -mtime option. ej., -50 para los ÃÂºltimos 50 dÃÂ­as, +50 para los que sean mÃÂ¡s antiguos de 50. Analisis MorfolÃÂ³gico: -b, --use-mecab usa MeCab para analizar japonÃÂ©s. -c, --use-chasen usa ChaSen para analizar japonÃÂ©s. -k, --use-kakasi usa KAKASI para analizar japonÃÂ©s. -m, --use-chasen-noun usa ChaSen para extraer sÃÂ³lo nombres. -L, --indexing-lang=LANG index with language specific processing. Operaciones de Texto: -E, --no-edge-symbol quita los sÃÂ­mbolos en los bordes de las palabras. -G, --no-okurigana kita la Okurigana en las palabras. -H, --no-hiragana ignora las palabras que sÃÂ³lo tengan Hiragana. -K, --no-symbol quitar sÃÂ­mbolos. --decode-base64 decode base64 bodies within multipart entities. Summarization: -U, --no-encode-uri no codificar el URI. -x, --no-heading-summary no hacer resumen con las cabeceras HTML. ConstrucciÃÂ³n del ÃÂwndice: --update=INDEX pon el INDEX para actualizaciÃÂ³n. -z, --check-filesize detect file size changed. -Y, --no-delete no detectar documentos borrados. -Z, --no-update no detectar documentos actualizados ni borrados. MiscelÃÂ¡neas: -s, --checkpoint pon activo el mecanismo de punto de chequeo. -C, --show-config muestra la configuraciÃÂ³n actual. -f, --config=FILE usa el fichero FILE como fichero de configuraciÃÂ³n. -I, --include=FILE incluye tu fichero de configuraciÃÂ³n FILE. -O, --output-dir=DIR pon el directorio DIR como directorio destino del ÃÂ­ndice. -T, --template-dir=DIR pon DIR teniendo los NMZ.{head,foot,body}.*. -q, --quiet suprime los mensajes de estado durante la ejecuciÃÂ³n. -v, --version muestra la versiÃÂ³n de namazu y sal. -V, --verbose modo verbose. -d, --debug modo debug. --help muestra esta ayuda y sal. --norc do not read the personal initialization files. -- Terminate option list. Reporta los errores a <%s> o <%s>.

source: No title in original
eo: No hay tÃÂ­tulo en el original

source: is excluded because of <meta name="robots" ...>
eo: estÃÂ¡ excluido porque <meta name="robots" ...>

source: Unsupported format:
eo: Formato no soportado:
